---
title: BalusterInfo
classe: Autodesk.Revit.DB.Architecture.BalusterInfo
namespace: Autodesk.Revit.DB.Architecture
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# BalusterInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId BalusterFamilyId { get; set; }` | `balusterInfo.BalusterFamilyId` | ElementId |
| `Double BaseOffset { get; set; }` | `balusterInfo.BaseOffset` | Double |
| `String BaseReferenceName { get; set; }` | `balusterInfo.BaseReferenceName` | String |
| `Double DistanceFromPreviousOrSpace { get; set; }` | `balusterInfo.DistanceFromPreviousOrSpace` | Double |
| `Boolean IsValidObject { get; }` | `balusterInfo.IsValidObject` | Boolean |
| `String Name { get; set; }` | `balusterInfo.Name` | String |
| `Double Offset { get; set; }` | `balusterInfo.Offset` | Double |
| `Double TopOffset { get; set; }` | `balusterInfo.TopOffset` | Double |
| `String TopReferenceName { get; set; }` | `balusterInfo.TopReferenceName` | String |
| `Void Dispose()` | `balusterInfo.Dispose()` | Void |
| `String GetReferenceNameForHost()` | `BalusterInfo.GetReferenceNameForHost()` | String |
| `String GetReferenceNameForTopRail()` | `BalusterInfo.GetReferenceNameForTopRail()` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```